{"config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "name": "lambda_16", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bS)\u0002Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-43-b142cd23f1e7>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "re_conv1", "filters": 24, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "re_bn1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "re_maxpool1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "re_conv2", "filters": 32, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "re_bn2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "re_maxpool2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "re_conv3", "filters": 48, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "re_bn3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "re_maxpool3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "re_conv4", "filters": 64, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "re_bn4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "re_maxpool4", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "re_conv5", "filters": 64, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same"}, "class_name": "Conv2D"}, {"config": {"beta_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "re_bn5", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "name": "re_maxpool5", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_16", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "re_den1", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 1164, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_41"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "re_den2", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 100, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_42"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "re_den3", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 50, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_43"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "re_den4", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 10, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "elu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_44"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_60", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "units": 1, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}