{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "re_conv1", "use_bias": true, "batch_input_shape": [null, 66, 200, 3], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "re_bn1", "center": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "re_maxpool1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "re_conv2", "use_bias": true, "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "re_bn2", "center": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "re_maxpool2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "re_conv3", "use_bias": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "re_bn3", "center": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "re_maxpool3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_28", "rate": 0.25, "trainable": true}}, {"class_name": "Conv2D", "config": {"name": "re_conv4", "use_bias": true, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "kernel_size": [3, 3], "padding": "valid", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "re_bn4", "center": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "re_maxpool4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_29", "rate": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true}}, {"class_name": "Dense", "config": {"name": "re_den1", "use_bias": true, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "re_bn5", "center": true, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_30", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "re_den2", "use_bias": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "trainable": true}}], "keras_version": "2.0.1", "backend": "tensorflow"}